## Introduction to Pandas :-
* Pandas is a Python package providing fast, flexible, and expressive data structure designed to make working with "relational" or "labeled" data both easy and intuitive.
* Here are just a few of the things that pandas does as wel:
   - It has function for analyzing, cleaning, exploring, and manipulating data.
* The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

### Application of Pandas :-
* Easy handling of missing data.
* Size mutability: columns can be inserted and deleted from DataFrame and higher dimensional objects.
* Automatic and explicit data alignment: objects can be explicitly aligned to a set of labels, or the user can simply ignore the labels and let Series, DataFrame etc.
* Automatically align the data for you in computations.
* Powerful, flexible group by functionality.
* Intelligent label-based slicing, fancy indexing, and subsetting of large data sets.
* Flexible reshaping and pivoting of data sets.

#### Data Structures in Pandas :-
* The best way to think about the pandas data structures is as flexible containers for lower dimensional data. For example, DataFrame is a container for series, and Series is a container for scalars. We would like to be able to insert and remove objects from these containers in a dictionary-like fashion.

#### Series in Pandas :-
* Pandas Series is one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labes are collectively called index. Pandas Series is nothing but a column in a excel sheet.
* The object supports both integer and label-based indexing and provides a host of methods for peforming operations involving the index.

#### DataFrames :-
* Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [1]:
import pandas as pd

In [2]:
data = {"Name": ["John","Peter","Benjo"],
       "Age":[25, 35, 34],
       "Salary":[30000, 40010, 50000]}

In [3]:
df = pd.DataFrame(data)

In [4]:
print(df)

    Name  Age  Salary
0   John   25   30000
1  Peter   35   40010
2  Benjo   34   50000

In [5]:
data = pd.read_csv("C:/Users/Er. HARSH/Desktop/Data Analysis/company1.csv")

In [6]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

Install library for importing excel file :- pip install openpyxl in cmd or in google colab or jupyter notebook in !pip install openpyxl

In [9]:
data = pd.read_excel("expense3.xlsx")

In [10]:
print(data)

         Date    Category       Sub-Category   Amount Payment Mode
0  2023-01-01     Grocery             Grocery      30         Cash
1  2023-01-02        Food          Restaurant     890          UPI
2  2023-01-04         123              Zomato     257          NaN
3  2023-01-06  Essentials               Diary     120          UPI
4  2023-01-06  Essentials             Perfume    1500         Cash
5  2023-01-09     Grocery  Fruits and Veggies     456         Cash
6  2023-01-10       Bills          House Rent   16000          UPI
7  2023-01-10     Grocery      Tomato KetchUp      70          UPI
8  2023-01-12        Food                Chai      15          UPI
9  2023-01-15  Essentials      Salt and Sugar      50          NaN
10 2023-01-17     Grocery           Chocolate     100          UPI
11 2023-01-17        Food          Restaurant     780         Card
12 2023-01-18  Essentials            Food Oil     120          NaN
13 2023-01-18        Food              Zomato     230          UPI
14 2023-01-19     Grocery                Milk      26          UPI
15 2023-01-20  Essentials             Shampoo     780          UPI
16 2023-01-20  Essentials           Lunch Box     890         Cash
17 2023-01-21     Clothes               Dress    1000          NaN
18 2023-01-22     Clothes               Dress    1890          UPI
19 2023-01-23     Grocery      Bread and Milk      56         Cash
20 2023-01-24        Food  Fruits and Veggies     530         Cash
21 2023-01-26        Food                Chai      10          UPI
22 2023-01-26     Grocery               Maggi     140          UPI
23 2023-01-27        Food              Zomato     300          UPI
24 2023-01-27        Food                Chai      10          UPI
25 2023-01-28  Essentials           Bedsheets    1025         Cash
26 2023-01-29       Bills             Mobile     1650          UPI
27 2023-01-29     Grocery                Daal     150         Cash
28 2023-01-30       Bills            Cylinder    1074          UPI

#### Exploring Data in Pandas :-

In [11]:
data = pd.read_excel("ESD.xlsx")

In [12]:
print(data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [13]:
print(data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [15]:
print(data.tail(10))

       EEID          Full Name             Job Title       Department  \
990  E01578       Anthony Hong            Sr. Manger               IT
991  E03430        Leo Herrera  Sr. Business Partner  Human Resources
992  E03058      Robert Wright   Technical Architect               IT
993  E04762  Audrey Richardson              Director               IT
994  E01148     Scarlett Kumar       Systems Analyst               IT
995  E03094       Wesley Young           Sr. Analyst        Marketing
996  E01909       Lillian Khan               Analyst          Finance
997  E04398        Oliver Yang              Director        Marketing
998  E02521        Lily Nguyen           Sr. Analyst          Finance
999  E03545        Sofia Cheng        Vice President       Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
990  Research & Development    Male      Asian   37 2010-11-29         146961
991  Research & Development    Male     Latino   48 1998-04-22          85369
992           Manufacturing    Male  Caucasian   30 2015-06-14          67489
993           Manufacturing  Female  Caucasian   46 2018-10-06         166259
994               Corporate  Female      Asian   55 2009-01-07          47032
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country      City  Exit Date
990     0.11  United States  Columbus        NaT
991     0.00         Brazil    Manaus 2004-11-27
992     0.00  United States   Chicago        NaT
993     0.17  United States   Chicago        NaT
994     0.00  United States  Columbus        NaT
995     0.00  United States  Columbus        NaT
996     0.00          China   Chengdu 2018-01-08
997     0.15  United States     Miami        NaT
998     0.00          China   Chengdu        NaT
999     0.31  United States     Miami        NaT

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB

In [17]:
data.describe()

               Age  Annual Salary      Bonus %
count  1000.000000    1000.000000  1000.000000
mean     44.382000  113217.365000     0.088660
std      11.246981   53545.985644     0.117856
min      25.000000   40063.000000     0.000000
25%      35.000000   71430.250000     0.000000
50%      45.000000   96557.000000     0.000000
75%      54.000000  150782.250000     0.150000
max      65.000000  258498.000000     0.400000

In [18]:
print(data.isnull())

      EEID  Full Name  Job Title  Department  Business Unit  Gender  \
0    False      False      False       False          False   False
1    False      False      False       False          False   False
2    False      False      False       False          False   False
3    False      False      False       False          False   False
4    False      False      False       False          False   False
..     ...        ...        ...         ...            ...     ...
995  False      False      False       False          False   False
996  False      False      False       False          False   False
997  False      False      False       False          False   False
998  False      False      False       False          False   False
999  False      False      False       False          False   False

     Ethnicity    Age  Hire Date  Annual Salary  Bonus %  Country   City  \
0        False  False      False          False    False    False  False
1        False  False      False          False    False    False  False
2        False  False      False          False    False    False  False
3        False  False      False          False    False    False  False
4        False  False      False          False    False    False  False
..         ...    ...        ...            ...      ...      ...    ...
995      False  False      False          False    False    False  False
996      False  False      False          False    False    False  False
997      False  False      False          False    False    False  False
998      False  False      False          False    False    False  False
999      False  False      False          False    False    False  False

     Exit Date
0        False
1         True
2         True
3         True
4         True
..         ...
995       True
996      False
997       True
998       True
999       True

[1000 rows x 14 columns]

In [20]:
print(data.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

#### Handling Duplicate Values in PANDAS :-

In [35]:
data = pd.read_csv("company1.csv")

In [36]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [23]:
print(data["EEID"].duplicated().sum())

2

In [24]:
print(data.drop_duplicates())

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [25]:
print(data.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

#### Working with missing data in Pandas :-
* Handling Null Values

In [28]:
print(data.isnull())

    EEID   Name  gender  salary
0  False  False   False    True
1  False  False   False   False
2  False  False    True   False
3  False  False   False   False
4  False   True   False   False
5  False  False   False    True
6  False  False   False   False

In [29]:
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [30]:
print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [31]:
import numpy as np

In [33]:
print(data.replace(np.nan,"30000"))

    EEID      Name gender   salary
0  EMP01    ayushi      F    30000
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  30000  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     30000      M  25000.0
5  EMP06     rohit      M    30000
6  EMP02     rohit      M  25000.0

In [34]:
data["salary"] = data["salary"].replace(np.nan, 30000)
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [37]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [38]:
print(data["salary"].mean())

24400.0

In [39]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [40]:
print(data.fillna(method = "bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

In [41]:
print(data.fillna(method = "ffill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

In [42]:
print(data.fillna("hello"))

    EEID      Name gender   salary
0  EMP01    ayushi      F    hello
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  hello  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     hello      M  25000.0
5  EMP06     rohit      M    hello
6  EMP02     rohit      M  25000.0

#### Columns Transformation Pandas

In [55]:
df = pd.read_excel("ESD.xlsx")

In [56]:
print(df)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [57]:
df.loc[(df["Bonus %"] == 0), "GetBonus"] = "no bonus"
df.loc[(df["Bonus %"] > 0, "GetBonus")] = "bonus"
print(df.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date  GetBonus
0     0.15  United States    Seattle 2021-10-16     bonus
1     0.00          China  Chongqing        NaT  no bonus
2     0.20  United States    Chicago        NaT     bonus
3     0.07  United States    Chicago        NaT     bonus
4     0.00  United States    Phoenix        NaT  no bonus
5     0.00          China  Chongqing        NaT  no bonus
6     0.10  United States    Phoenix        NaT     bonus
7     0.00  United States      Miami 2021-05-20  no bonus
8     0.06  United States     Austin        NaT     bonus
9     0.00  United States    Chicago        NaT  no bonus

#### Group By in Pandas :-

In [27]:
import pandas as pd
import numpy as np

In [28]:
data = pd.read_excel("ESD.xlsx")
print(data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [30]:
data.head(10)

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02387,Emily Davis,Sr. Manger,IT,Research & Development,Female,Black,55,2016-04-08,141604,0.15,United States,Seattle,2021-10-16
1,E04105,Theodore Dinh,Technical Architect,IT,Manufacturing,Male,Asian,59,1997-11-29,99975,0.00,China,Chongqing,NaT
2,E02572,Luna Sanders,Director,Finance,Speciality Products,Female,Caucasian,50,2006-10-26,163099,0.20,United States,Chicago,NaT
3,E02832,Penelope Jordan,Computer Systems Manager,IT,Manufacturing,Female,Caucasian,26,2019-09-27,84913,0.07,United States,Chicago,NaT
4,E01639,Austin Vo,Sr. Analyst,Finance,Manufacturing,Male,Asian,55,1995-11-20,95409,0.00,United States,Phoenix,NaT
5,E00644,Joshua Gupta,Account Representative,Sales,Corporate,Male,Asian,57,2017-01-24,50994,0.00,China,Chongqing,NaT
6,E01550,Ruby Barnes,Manager,IT,Corporate,Female,Caucasian,27,2020-07-01,119746,0.10,United States,Phoenix,NaT
7,E04332,Luke Martin,Analyst,Finance,Manufacturing,Male,Black,25,2020-05-16,41336,0.00,United States,Miami,2021-05-20
8,E04533,Easton Bailey,Manager,Accounting,Manufacturing,Male,Caucasian,29,2019-01-25,113527,0.06,United States,Austin,NaT
9,E03838,Madeline Walker,Sr. Analyst,Finance,Speciality Products,Female,Caucasian,34,2018-06-13,77203,0.00,United States,Chicago,NaT

In [13]:
gp = data.groupby("Department").agg({"Gender":"count"})
print(gp)

                 Gender
Department
Accounting           96
Engineering         158
Finance             120
Human Resources     125
IT                  241
Marketing           120
Sales               140

In [14]:
gp = data.groupby("Job Title").agg({"EEID":"count"})
print(gp)

                                EEID
Job Title
Account Representative            21
Analyst                           51
Analyst II                        53
Automation Engineer                7
Business Partner                  19
Cloud Infrastructure Architect    15
Computer Systems Manager          21
Controls Engineer                 15
Development Engineer              19
Director                         121
Engineering Manager               20
Enterprise Architect              18
Field Engineer                    21
HRIS Analyst                      16
IT Coordinator                    11
IT Systems Architect              12
Manager                           98
Network Administrator             10
Network Architect                 18
Network Engineer                   7
Operations Engineer               12
Quality Engineer                  20
Service Desk Analyst              10
Solutions Architect               15
Sr. Account Representative         9
Sr. Analyst                       70
Sr. Business Partner              17
Sr. Manger                       110
System Administrator             15
Systems Analyst                   15
Technical Architect               17
Test Engineer                     12
Vice President                   105

In [15]:
gp = data.groupby(["Department", "Gender"]).agg({"EEID":"count"})
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [23]:
gp = data.groupby("Country").agg({"EEID":"count"})
print(gp)

               EEID
Country
Brazil          139
China           218
United States   643

In [25]:
gp = data.groupby("Country").agg({"Age":"mean"})
print(gp)

                     Age
Country
Brazil         43.654676
China          45.389908
United States  44.197512

In [39]:
gp = data.groupby("Country").agg({"Annual Salary":"max"})
print(gp)

               Annual Salary
Country
Brazil                258426
China                 257194
United States         258498

In [41]:
gp = data.groupby(["Country", "Gender"]).agg({"Annual Salary":"max", "Age":"max"})
print(gp)

                      Annual Salary  Age
Country       Gender
Brazil        Female         258426   65
              Male           249506   65
China         Female         249686   65
              Male           257194   65
United States Female         258498   65
              Male           258081   65

In [36]:
gp = data.groupby(["Country", "Gender"]).agg({"Annual Salary":"min", "Age":"min"})
print(gp)

                      Annual Salary  Age
Country       Gender
Brazil        Female          44735   25
              Male            40316   26
China         Female          46833   25
              Male            41728   25
United States Female          40124   25
              Male            40063   25

#### Merge, Join and Concatenate in Pandas :-

In [68]:
import pandas as pd

In [49]:
data1 = {"Emp ID":["E01","E02","E03","E04","E05","E06"],
        "Names":["Ram","Shyam","Rahul","Gita","Sita","Rita"],
        "Age":[25,30,45,23,25,31]}

data2 = {"Emp ID":["E01","E02","E03","E04","E05","E06"],
        "Salary":[45000,25000,35000,22000,24000,43000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print("*"*20)
print(df2)

  Emp ID  Names  Age
0    E01    Ram   25
1    E02  Shyam   30
2    E03  Rahul   45
3    E04   Gita   23
4    E05   Sita   25
5    E06   Rita   31
********************
  Emp ID  Salary
0    E01   45000
1    E02   25000
2    E03   35000
3    E04   22000
4    E05   24000
5    E06   43000

In [50]:
print(pd.merge(df1, df2, on = "Emp ID"))

  Emp ID  Names  Age  Salary
0    E01    Ram   25   45000
1    E02  Shyam   30   25000
2    E03  Rahul   45   35000
3    E04   Gita   23   22000
4    E05   Sita   25   24000
5    E06   Rita   31   43000

In [51]:
print(pd.merge(left = df1, right = df2, on = "Emp ID", how = "right"))

  Emp ID  Names  Age  Salary
0    E01    Ram   25   45000
1    E02  Shyam   30   25000
2    E03  Rahul   45   35000
3    E04   Gita   23   22000
4    E05   Sita   25   24000
5    E06   Rita   31   43000

In [70]:
print(pd.join([df1, df2]))

AttributeError: module 'pandas' has no attribute 'join'

In [61]:
data1 = {"Emp ID":["E01","E02","E03","E04","E05","E06"],
        "Names":["Ram","Shyam","Rahul","Gita","Sita","Rita"],
        "Age":[25,30,45,23,25,31]}

data2 = {"Emp ID":["E07","E08","E09","E10","E11","E12"],
        "Names":["Aunty","Bunty","Ramu","Molu","Golu","Raju"],
        "Age":[25,30,45,23,25,31]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [62]:
print(pd.concat([df1, df2]))

  Emp ID  Names  Age
0    E01    Ram   25
1    E02  Shyam   30
2    E03  Rahul   45
3    E04   Gita   23
4    E05   Sita   25
5    E06   Rita   31
0    E07  Aunty   25
1    E08  Bunty   30
2    E09   Ramu   45
3    E10   Molu   23
4    E11   Golu   25
5    E12   Raju   31

#### Pandas | Compare DataFrames

In [64]:
dict = {"Fruits":["Mango", "Apple", "Banana", "Papaya"],
       "Price":[100, 150, 50, 30],
       "Quantity":[15, 10, 10, 3]}

In [65]:
df = pd.DataFrame(dict)

In [66]:
print(df)

   Fruits  Price  Quantity
0   Mango    100        15
1   Apple    150        10
2  Banana     50        10
3  Papaya     30         3

In [67]:
df1 = df.copy()
print(df1)

   Fruits  Price  Quantity
0   Mango    100        15
1   Apple    150        10
2  Banana     50        10
3  Papaya     30         3

In [71]:
df1.loc[0, "Price"] = 120
df1.loc[1, "Price"] = 180

In [72]:
print(df1)

   Fruits  Price  Quantity
0   Mango    120        15
1   Apple    180        10
2  Banana     50        10
3  Papaya     30         3

In [73]:
print(df.compare(df1))

   Price
    self  other
0  100.0  120.0
1  150.0  180.0

In [74]:
print(df.compare(df1, align_axis=0))

         Price
0 self   100.0
  other  120.0
1 self   150.0
  other  180.0

In [76]:
print(df.compare(df1, keep_shape=True))

  Fruits        Price        Quantity
    self other   self  other     self other
0    NaN   NaN  100.0  120.0      NaN   NaN
1    NaN   NaN  150.0  180.0      NaN   NaN
2    NaN   NaN    NaN    NaN      NaN   NaN
3    NaN   NaN    NaN    NaN      NaN   NaN

In [77]:
print(df.compare(df1, keep_shape=False))

   Price
    self  other
0  100.0  120.0
1  150.0  180.0

#### Pandas - Pivoting and Melting DataFrames

In [83]:
import pandas as pd
dict = {"keys":["k1", "k2", "k1", "k2"],
       "Names":["Jonh", "David", "Ben", "Lisa"],
       "Houses":["red", "blue", "green", "yellow"],
       "Grades":["8th","10th","4th","104th"]}
df = pd.DataFrame(dict)

In [84]:
print(df)

  keys  Names  Houses Grades
0   k1   Jonh     red    8th
1   k2  David    blue   10th
2   k1    Ben   green    4th
3   k2   Lisa  yellow  104th

In [87]:
print(df.pivot("keys","Names","Houses"))

Names    Ben David Jonh    Lisa
keys
k1     green   NaN  red     NaN
k2       NaN  blue  NaN  yellow

C:\Users\Er. HARSH\AppData\Local\Temp\ipykernel_9276\1245266059.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  print(df.pivot("keys","Names","Houses"))

In [89]:
print(df.pivot(index="keys", columns="Names", values=["Houses", "Grades"]))

      Houses                    Grades
Names    Ben David Jonh    Lisa    Ben David Jonh   Lisa
keys
k1     green   NaN  red     NaN    4th   NaN  8th    NaN
k2       NaN  blue  NaN  yellow    NaN  10th  NaN  104th

In [90]:
import pandas as pd
dict = {"Names":["Jonh", "David", "Ben", "Lisa"],
       "Houses":["red", "blue", "green", "yellow"],
       "Grades":["8th","10th","4th","104th"]}
df = pd.DataFrame(dict)

In [91]:
print(df)

   Names  Houses Grades
0   Jonh     red    8th
1  David    blue   10th
2    Ben   green    4th
3   Lisa  yellow  104th

In [92]:
print(pd.melt(df, id_vars=["Names"], value_vars=["Houses"]))

   Names variable   value
0   Jonh   Houses     red
1  David   Houses    blue
2    Ben   Houses   green
3   Lisa   Houses  yellow